# Menata ulang penempatan kolom pada Data Frame

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  3  1  1  4  1
1  1  8  1  5  1
2  4  9  2  2  6
3  1  5  2  4  8
4  9  7  6  3  1

# Menata ulang penempatan kolom pada Data Frame#

In [3]:
df[['D', 'C', 'A', 'E', 'B']]

   D  C  A  E  B
0  4  1  3  1  1
1  5  1  1  1  8
2  2  2  4  6  9
3  4  2  1  8  5
4  3  6  9  1  7

In [4]:
df

   A  B  C  D  E
0  3  1  1  4  1
1  1  8  1  5  1
2  4  9  2  2  6
3  1  5  2  4  8
4  9  7  6  3  1

In [5]:
df = df[['D', 'C', 'A', 'E', 'B']]
df

   D  C  A  E  B
0  4  1  3  1  1
1  5  1  1  1  8
2  2  2  4  6  9
3  4  2  1  8  5
4  3  6  9  1  7